---
kind: other
id: Properties.T:Autodesk.Revit.DB.ChangeType
source: html/fda47d79-15d5-77fc-7ac6-3e537b684711.htm
---
# ChangeType Properties

Specifies whether the .NET object represents a valid Revit entity.